Revit 2027 API
WireType.MaxSize Property
 The max conductor size name of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string MaxSize { get; set; }
Public Property MaxSize As String
	Get
	Set
public:
property String^ MaxSize {
	String^ get ();
	void set (String^ value);
}
member MaxSize : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The name is neither a conductor size name nor empty.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace